/*===========================================================================
   Copyright (c) 2021 Qualcomm Technologies, Inc.
   All Rights Reserved.
   Confidential and Proprietary - Qualcomm Technologies, Inc.
===========================================================================*/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_7_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_7_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>
#include <vendor/qti/hardware/radio/ims/1.3/types.h>
#include <vendor/qti/hardware/radio/ims/1.4/types.h>
#include <vendor/qti/hardware/radio/ims/1.5/types.h>
#include <vendor/qti/hardware/radio/ims/1.6/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_7 {

// Forward declaration for forward reference support:
enum class CrsType : int32_t;
struct CrsData;
enum class CallProgressInfoType : int32_t;
struct CallProgressInfo;
struct CallInfo;

// Order of inner types was changed for forward reference support.

enum class CrsType : int32_t {
    INVALID = 0,
    AUDIO = 1 /* 1 << 0 */,
    VIDEO = 2 /* 1 << 1 */,
};

struct CrsData final {
    /*
     * INVALID if CrsData is invalid,
     * AUDIO if only audio will be played,
     * VIDEO if only video will be played,
     * AUDIO | VIDEO if both video and audio will be played.
     */
    ::android::hardware::hidl_bitfield<::vendor::qti::hardware::radio::ims::V1_7::CrsType> type __attribute__ ((aligned(4)));
    /*
     * Valid only if CrsData.type is not INVALID
     * Call type of the actual call received from network.
     */
    ::vendor::qti::hardware::radio::ims::V1_0::CallType originalCallType __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CrsData, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CrsData, originalCallType) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_7::CrsData) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_7::CrsData) == 4, "wrong alignment");

enum class CallProgressInfoType : int32_t {
    INVALID = 0,
    /*
     * Invalid if CallProgressInfo is not present.
     */
    CALL_REJ_Q850 = 1 /* ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfoType.INVALID implicitly + 1 */,
    /*
     * MO call will be rejected with protocol Q850 error
     */
    CALL_WAITING = 2 /* ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfoType.CALL_REJ_Q850 implicitly + 1 */,
    /*
     * There is already an ACTIVE call at remote UE side and this call is a
     * WAITING call from remote UE perspective.
     */
    CALL_FORWARDING = 3 /* ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfoType.CALL_WAITING implicitly + 1 */,
    /*
     * Call forwarding is enabled at remote UE and this call will be forwarded
     * from remote UE perspective.
     */
    REMOTE_AVAILABLE = 4 /* ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfoType.CALL_FORWARDING implicitly + 1 */,
};

struct CallProgressInfo final {
    ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfoType type __attribute__ ((aligned(4)));
    /*
     * Type of call progress info
     */
    uint16_t reasonCode __attribute__ ((aligned(2)));
    /*
     * Reason code for call rejection, this will be valid only for
     * CallProgressInfoType#CALL_REJ_Q850.
     */
    ::android::hardware::hidl_string reasonText __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo, reasonCode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo, reasonText) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal mtMultiLineInfo __attribute__ ((aligned(8)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_6::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_3::VerstatInfo verstatInfo __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::TirMode tirMode __attribute__ ((aligned(4)));
    /*
     * True if the message is intended for preliminary resource allocation
     * only and shall not be visible to the end user.
     * Default: False
     */
    bool isPreparatory __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_7::CrsData crsData __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_7::CallProgressInfo callProgInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, mtMultiLineInfo) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, als) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsVoice) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isVoice) == 45, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsVoicePrivacy) == 46, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isVoicePrivacy) == 47, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, number) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, numberPresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, name) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, namePresentation) == 88, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasCallDetails) == 92, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, callDetails) == 96, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasFailCause) == 192, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, failCause) == 200, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsEncrypted) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isEncrypted) == 273, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsCalledPartyRinging) == 274, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isCalledPartyRinging) == 275, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, historyInfo) == 280, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, hasIsVideoConfSupported) == 296, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isVideoConfSupported) == 297, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, verstatInfo) == 300, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, tirMode) == 308, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, isPreparatory) == 312, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, crsData) == 316, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo, callProgInfo) == 328, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo) == 352, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_7::CallInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::vendor::qti::hardware::radio::ims::V1_7::CrsType o);
static inline void PrintTo(::vendor::qti::hardware::radio::ims::V1_7::CrsType o, ::std::ostream* os);
constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_7::CrsType lhs, const ::vendor::qti::hardware::radio::ims::V1_7::CrsType rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_7::CrsType rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_7::CrsType lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
