/*
  Copyright (c) 2022 Qualcomm Technologies, Inc.
  All Rights Reserved.
  Confidential and Proprietary - Qualcomm Technologies, Inc.
*/
#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_QTIRADIO_V2_7_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_QTIRADIO_V2_7_TYPES_H

#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace qtiradio {
namespace V2_7 {

// Forward declaration for forward reference support:
struct QosBandwidth;
struct EpsQos;
struct NrQos;
struct Qos;
struct QosParametersResult;
enum class QosFlowIdRange : uint8_t;
enum class QosPortRange : uint16_t;
struct PortRange;
struct MaybePort;
enum class QosProtocol : int8_t;
enum class QosFilterDirection : int8_t;
struct QosFilter;
struct QosSession;

// Order of inner types was changed for forward reference support.

struct QosBandwidth final {
    /**
     * Maximum bit rate possible on the bearer
     */
    uint32_t maxBitrateKbps __attribute__ ((aligned(4)));
    /**
     * Minimum bit rate that is guaranteed to be provided by the network
     */
    uint32_t guaranteedBitrateKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth, maxBitrateKbps) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth, guaranteedBitrateKbps) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth) == 4, "wrong alignment");

/**
 * LTE/EPS Quality of Service parameters as per 3gpp spec 24.301 sec 9.9.4.3.
 */
struct EpsQos final {
    /**
     * Quality of Service Class Identifier (QCI), see 3GPP TS 23.203 and 29.212.
     * The allowed values are standard values(1-9, 65-68, 69-70, 75, 79-80, 82-85)
     * defined in the spec and operator specific values in the range 128-254.
     */
    uint16_t qci __attribute__ ((aligned(2)));
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth downlink __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth uplink __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos, qci) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos, downlink) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos, uplink) == 12, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos) == 20, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos) == 4, "wrong alignment");

/**
 * 5G Quality of Service parameters as per 3gpp spec 24.501 sec 9.11.4.12
 */
struct NrQos final {
    /**
     * 5G QOS Identifier (5QI), see 3GPP TS 24.501 and 23.501.
     * The allowed values are standard values(1-9, 65-68, 69-70, 75, 79-80, 82-85)
     * defined in the spec and operator specific values in the range 128-254.
     */
    uint16_t fiveQi __attribute__ ((aligned(2)));
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth downlink __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth uplink __attribute__ ((aligned(4)));
    /**
     * QOS flow identifier of the QOS flow description in the
     * range of QosFlowIdRange::MIN to QosFlowIdRange::MAX
     */
    uint8_t qfi __attribute__ ((aligned(1)));
    uint16_t averagingWindowMs __attribute__ ((aligned(2)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos, fiveQi) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos, downlink) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos, uplink) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos, qfi) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos, averagingWindowMs) == 22, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos) == 4, "wrong alignment");

/**
 * EPS or NR QOS parameters
 */
struct Qos final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        eps = 1,  // ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos
        nr = 2,  // ::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos
    };

    Qos();
    ~Qos();
    Qos(Qos&&);
    Qos(const Qos&);
    Qos& operator=(Qos&&);
    Qos& operator=(const Qos&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void eps(const ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos&);
    void eps(::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos&&);
    ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos& eps();
    const ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos& eps() const;

    void nr(const ::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos&);
    void nr(::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos&&);
    ::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos& nr();
    const ::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos& nr() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos eps __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::radio::qtiradio::V2_7::NrQos nr __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos::hidl_union) == 24, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos) == 28, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::Qos) == 4, "wrong alignment");

struct QosParametersResult final {
    /**
     * Default bearer QoS. Applicable to LTE and NR
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::Qos defaultQos __attribute__ ((aligned(4)));
    /**
     * Active QOS sessions of the dedicated bearers. Applicable to
     * PDNs that support dedicated bearers.
     */
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession> qosSessions __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosParametersResult, defaultQos) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosParametersResult, qosSessions) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosParametersResult) == 48, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosParametersResult) == 8, "wrong alignment");

/**
 * Allowed values for 5G QOS flow identifier
 */
enum class QosFlowIdRange : uint8_t {
    MIN = 1,
    MAX = 63,
};

/**
 * Allowed port numbers
 */
enum class QosPortRange : uint16_t {
    MIN = 20,
    MAX = 65535,
};

/**
 * Defines range of ports. start and end are the first and last port numbers
 * (inclusive) in the range. Both start and end are in QosPortRange.MIN to
 * QosPortRange.MAX range. A single port shall be represented by the same
 * start and end value.
 */
struct PortRange final {
    int32_t start __attribute__ ((aligned(4)));
    int32_t end __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange, start) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange, end) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange) == 4, "wrong alignment");

/**
 * Port is optional, contains either single port or range of ports
 */
struct MaybePort final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        range = 1,  // ::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange
    };

    MaybePort();
    ~MaybePort();
    MaybePort(MaybePort&&);
    MaybePort(const MaybePort&);
    MaybePort& operator=(MaybePort&&);
    MaybePort& operator=(const MaybePort&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void range(const ::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange&);
    void range(::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange&&);
    ::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange& range();
    const ::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange& range() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::vendor::qti::hardware::radio::qtiradio::V2_7::PortRange range __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort::hidl_union) == 8, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort) == 12, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort) == 4, "wrong alignment");

/**
 * Next header protocol numbers defined by IANA, RFC 5237
 */
enum class QosProtocol : int8_t {
    /**
     * No protocol specified
     */
    UNSPECIFIED = -1 /* -1 */,
    /**
     * Transmission Control Protocol
     */
    TCP = 6,
    /**
     * User Datagram Protocol
     */
    UDP = 17,
    /**
     * Encapsulating Security Payload Protocol
     */
    ESP = 50,
    /**
     * Authentication Header
     */
    AH = 51,
};

enum class QosFilterDirection : int8_t {
    DOWNLINK = 0,
    UPLINK = 1,
    BIDIRECTIONAL = 2,
};

/**
 * See 3gpp 24.008 10.5.6.12 and 3gpp 24.501 9.11.4.13
 */
struct QosFilter final {
    // Forward declaration for forward reference support:
    struct TypeOfService;
    struct Ipv6FlowLabel;
    struct IpsecSpi;

    struct TypeOfService final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint8_t
        };

        TypeOfService();
        ~TypeOfService();
        TypeOfService(TypeOfService&&);
        TypeOfService(const TypeOfService&);
        TypeOfService& operator=(TypeOfService&&);
        TypeOfService& operator=(const TypeOfService&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint8_t);
        uint8_t& value();
        uint8_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint8_t value __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService::hidl_union) == 1, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService) == 2, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService) == 1, "wrong alignment");

    struct Ipv6FlowLabel final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint32_t
        };

        Ipv6FlowLabel();
        ~Ipv6FlowLabel();
        Ipv6FlowLabel(Ipv6FlowLabel&&);
        Ipv6FlowLabel(const Ipv6FlowLabel&);
        Ipv6FlowLabel& operator=(Ipv6FlowLabel&&);
        Ipv6FlowLabel& operator=(const Ipv6FlowLabel&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint32_t);
        uint32_t& value();
        uint32_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint32_t value __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel) == 8, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel) == 4, "wrong alignment");

    struct IpsecSpi final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint32_t
        };

        IpsecSpi();
        ~IpsecSpi();
        IpsecSpi(IpsecSpi&&);
        IpsecSpi(const IpsecSpi&);
        IpsecSpi& operator=(IpsecSpi&&);
        IpsecSpi& operator=(const IpsecSpi&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint32_t);
        uint32_t& value();
        uint32_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint32_t value __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi) == 8, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi) == 4, "wrong alignment");

    /**
     * Local and remote IP addresses, typically one IPv4 or one IPv6
     * or one of each. Addresses could be with optional "/" prefix
     * length, e.g.,"192.0.1.3" or "192.0.1.11/16 2001:db8::1/64".
     * If the prefix length is absent, the addresses are assumed to be
     * point to point with IPv4 having a prefix length of 32 and
     * IPv6 128.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> localAddresses __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> remoteAddresses __attribute__ ((aligned(8)));
    /**
     * Local and remote port/ranges
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort localPort __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::qtiradio::V2_7::MaybePort remotePort __attribute__ ((aligned(4)));
    /**
     * QoS protocol
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosProtocol protocol __attribute__ ((aligned(1)));
    /**
     * Type of service value or mask as defined in RFC 1349
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::TypeOfService tos __attribute__ ((aligned(1)));
    /**
     * IPv6 flow label as defined in RFC 6437
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::Ipv6FlowLabel flowLabel __attribute__ ((aligned(4)));
    /**
     * IPSec security parameter index
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter::IpsecSpi spi __attribute__ ((aligned(4)));
    /**
     * Filter direction
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilterDirection direction __attribute__ ((aligned(1)));
    /**
     * Specifies the order in which the filter needs to be matched.
     * A lower numerical(positive) value has a higher precedence.
     * Set -1 when unspecified.
     */
    int32_t precedence __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, localAddresses) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, remoteAddresses) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, localPort) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, remotePort) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, protocol) == 56, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, tos) == 57, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, flowLabel) == 60, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, spi) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, direction) == 76, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter, precedence) == 80, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter) == 88, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter) == 8, "wrong alignment");

/**
 * QOS session associated with a dedicated bearer
 */
struct QosSession final {
    /**
     * Unique ID of the QoS session within the data call
     */
    int32_t qosSessionId __attribute__ ((aligned(4)));
    /**
     * QOS attributes
     */
    ::vendor::qti::hardware::radio::qtiradio::V2_7::Qos qos __attribute__ ((aligned(4)));
    /**
     * List of QOS filters associated with this session
     */
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::qtiradio::V2_7::QosFilter> qosFilters __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession, qosSessionId) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession, qos) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession, qosFilters) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession) == 48, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::qtiradio::V2_7::QosSession) == 8, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& o);
static inline void PrintTo(const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& o, ::std::ostream*);
static inline bool operator==(const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& lhs, const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& rhs);
static inline bool operator!=(const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& lhs, const ::vendor::qti::hardware::radio::qtiradio::V2_7::QosBandwidth& rhs);

static inline std::string toString(const ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos& o);
static inline void PrintTo(const ::vendor::qti::hardware::radio::qtiradio::V2_7::EpsQos& o, ::std::ostream*);
